Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.0.21/samha0wb/svd/ATSAMHA0G15WB.svd
            <register>
               <name>WAVEB</name>
               <description>Waveform Control Buffer</description>
               <addressOffset>0x68</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WAVEGENB</name>
                     <description>Waveform Generation Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>WAVEGENBSelect</name>
                        <enumeratedValue>
                           <name>NFRQ</name>
                           <description>Normal frequency</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MFRQ</name>
                           <description>Match frequency</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NPWM</name>
                           <description>Normal PWM</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSCRITICAL</name>
                           <description>Dual-slope critical</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSBOTTOM</name>
                           <description>Dual-slope with interrupt/event condition when COUNT reaches ZERO</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSBOTH</name>
                           <description>Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSTOP</name>
                           <description>Dual-slope with interrupt/event condition when COUNT reaches TOP</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RAMPB</name>
                     <description>Ramp Mode Buffer</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RAMPBSelect</name>
                        <enumeratedValue>
                           <name>RAMP1</name>
                           <description>RAMP1 operation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RAMP2A</name>
                           <description>Alternative RAMP2 operation</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RAMP2</name>
                           <description>RAMP2 operation</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CIPERENB</name>
                     <description>Circular Period Enable Buffer</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CICCENB0</name>
                     <description>Circular Channel 0 Enable Buffer</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CICCENB1</name>
                     <description>Circular Channel 1 Enable Buffer</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CICCENB2</name>
                     <description>Circular Channel 2 Enable Buffer</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CICCENB3</name>
                     <description>Circular Channel 3 Enable Buffer</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POLB0</name>
                     <description>Channel 0 Polarity Buffer</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POLB1</name>
                     <description>Channel 1 Polarity Buffer</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POLB2</name>
                     <description>Channel 2 Polarity Buffer</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POLB3</name>
                     <description>Channel 3 Polarity Buffer</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWAPB0</name>
                     <description>Swap DTI Output Pair 0 Buffer</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWAPB1</name>
                     <description>Swap DTI Output Pair 1 Buffer</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWAPB2</name>
                     <description>Swap DTI Output Pair 2 Buffer</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWAPB3</name>
                     <description>Swap DTI Output Pair 3 Buffer</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERB</name>
               <description>Period Buffer</description>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>PERB</name>
                     <description>Period Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERB_DITH4_MODE</name>
               <description>Period Buffer</description>
               <alternateRegister>PERB</alternateRegister>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHERCYB</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PERB</name>
                     <description>Period Buffer Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERB_DITH5_MODE</name>
               <description>Period Buffer</description>
               <alternateRegister>PERB</alternateRegister>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHERCYB</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PERB</name>
                     <description>Period Buffer Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PERB_DITH6_MODE</name>
               <description>Period Buffer</description>
               <alternateRegister>PERB</alternateRegister>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>DITHERCYB</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>PERB</name>
                     <description>Period Buffer Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCB[%s]</name>
               <description>Compare and Capture Buffer</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CCB</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCB_DITH4_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCB[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERCYB</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CCB</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCB_DITH5_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCB[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERCYB</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CCB</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>CCB_DITH6_MODE[%s]</name>
               <description>Compare and Capture Buffer</description>
               <alternateRegister>CCB[%s]</alternateRegister>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DITHERCYB</name>
                     <description>Dithering Buffer Cycle Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>CCB</name>
                     <description>Channel Compare/Capture Buffer Value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>18</bitWidth>
                  </field>
               </fields>
            </register>
